{
    "version": 4,
    "application": {
        "name": "Resource Calculator",
        "description": "This tool helps in the calculation of the required quantity of resources for making an item with the assistance of a guide.",
        "keywords": [
            "{application_name}"
        ]
    },
    "tool": {
        "name": "{game_name} Resource Calculator",
        "description": "{tool_name} quickly calculates the raw resources you need for your builds and provides an easy guide with instructions.",
        "game_specific_words": [
            "items"
        ],
        "keywords": [
            "{tool_name}",
            "{game_name} block calculator",
            "{game_name} crafting calculator",
            "{game_name} item calculator"
        ],
        "introduction": "For {game_name} enthusiasts who want to streamline their building process, the {tool_name} is a must-have tool. Crafting is an essential part of the game, whether you're progressing or working on an epic project. Our calculator takes the guesswork out of the process by accurately calculating the amount of resources needed for any item and instructions on how to craft them.",
        "examples": [
            {
                "title": "What are the base resources for {items.difficult_item_name}?",
                "text": "They are <span class='base-resources' item-id='{items.difficult_item_id}'></span>"
            },
            {
                "title": "What are the base resources for {items.medium_item_name}?",
                "text": "They are <span class='base-resources' item-id='{items.medium_item_id}'></span>"
            }
        ],
        "questions": [
            {
                "title": "How to calculate the amount of resources in {game_name}?",
                "text": "You can calculate the amount of resources needed for an item by checking the needed input items in the recipe to make your item. Then you check the needed input items for these items. You repeat this process until your input items are items you can gather in {game_name}. These items are the resources required to make your desired item."
            },
            {
                "title": "How to use the {tool_name}?",
                "text": "To begin creating an item in {game_name}, first determine which item you wish to make and the desired quantity. Next, locate the item by either searching for its name in the search bar or selecting it from the tabs. Once you have found the item, specify the required amount. The resource menu will display the necessary resources and quantities to make the item, while the guide menu will provide step-by-step instructions. You can now return to the game and proceed with crafting your item."
            },
            {
                "title": "Why is the {tool_name} useful?",
                "text": "Our tool not only streamlines the resource gathering process, but it also saves a significant amount of time that would otherwise be spent on unnecessary resource collection. By providing precise calculations for the required items, you can avoid spending excessive amounts of time gathering resources and instead focus on bringing your creative ideas to life in {game_name}."
            },
            {
                "title": "How many items exist in {game_name}?",
                "text": "This is a difficult question, because there are a lot of versions of {game_name}. When we look at the most recent version of {game_name} and we also included unobtainable items, then there are {items.amount} items in {game_name}."
            }
        ]
    }
}